src/main/resources/xml/accommodationFulfillmentServicePort/printCollateral/printCollateral.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:printCollateral>
         <request>
            <!--Optional:-->
            <travelPlanId>?</travelPlanId>
            <checkInFlag>?</checkInFlag>
            <!--Zero or more repetitions:-->
            <printDetails>
               <folioId>?</folioId>
               <tray>?</tray>
               <printerName>?</printerName>
               <printItemType>?</printItemType>
               <printDate>?</printDate>
            </printDetails>
         </request>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </acc:printCollateral>
   </soapenv:Body>
</soapenv:Envelope>
